VatEngine/src/test/resources/GCC_LOCALSALEOFGOODS_Test19.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?>
<iVATEngineInput>
	<Supplier>
		<ID>21536</ID>
		<Name>BETRADING NV</Name>
		<Address>KERKSTRAAT 17</Address>
		<ZIP>2000</ZIP>
		<City>ANTWERPEN</City>
		<Country>BE</Country>
		<RegOfCommerce/>
		<BancAccountNumber/>
		<IBAN/>
		<BIC/>
		<TelephoneNumber/>
		<FaxNumber/>
		<EmailAddress/>
		<SpecialType>8</SpecialType>
		<DeductionType>0</DeductionType>
		<VATNumberSupplier Country="BE">
			<VATNumber>BE012345678</VATNumber>
			<VATNumberType>1</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<TaxNumber/>
			<BelongsToFiscalUnit>0</BelongsToFiscalUnit>
		</VATNumberSupplier>
		<CountryChosenVATNumber>BE</CountryChosenVATNumber>
	</Supplier>
	<Customer>
		<ID>21545</ID>
		<Name>NLCOMPANY BV</Name>
		<Address>MEERSTRAAT 30</Address>
		<ZIP>3068</ZIP>
		<City>ROTTERDAM</City>
		<EmailAddress/>
		<Country>NL</Country>
		<SpecialType>0</SpecialType>
		<VATNumberCustomer Country="NL">
			<VATNumber>NL261806884B01</VATNumber>
			<VATNumberType>1</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<RequiredOnInvoicePicture>false</RequiredOnInvoicePicture>
			<BelongsToFiscalUnit>0</BelongsToFiscalUnit>
		</VATNumberCustomer>
		<CountryChosenVATNumber>NL</CountryChosenVATNumber>
	</Customer>
	<InvoiceProperties>
		<DocumentType>0</DocumentType>
		<Disconto>0</Disconto>
		<Currency1>EUR</Currency1>
		<InvoiceNumber/>
		<ReferenceInvoiceNumber/>
		<InvoiceDate>2019-02-12</InvoiceDate>
		<OfficialLanguage>1</OfficialLanguage>
	</InvoiceProperties>
	<Item ID="1">
		<Properties>
			<Description/>
			<InternationalDescription LanguageID="1">goederenvervoer (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="2">transport de biens (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="3">transport of goods (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="4">transporte de mercanc¡as (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="5">güterbeförderung  (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="6">trocas comerciais (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="7">trasporto di merci (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="10">tavarakuljetus (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="11">varutransport (-206-)</InternationalDescription>
			<InternationalDescription LanguageID="15">precu parvadajumi (-206-)</InternationalDescription>
			<TaricCode/>
			<CPCCode/>
			<Amounts CurrencyNumber="1">
				<UnitPriceExclVAT>100</UnitPriceExclVAT>
				<TotalAmountExclVAT>100</TotalAmountExclVAT>
				<PackagingCosts>0</PackagingCosts>
			</Amounts>
			<Number>1</Number>
			<Unit/>
			<VATRate>5</VATRate>
			<Reduction>0</Reduction>
			<AdditionalProperties>
				<PropertiesPerCountry Country="BE">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<PropertiesPerCountry Country="NL">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<PropertiesPerCountry Country="AE">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<EngineParameter1/>
				<EngineParameter2>AB00000000000A</EngineParameter2>
				<EngineParameter3>A</EngineParameter3>
			</AdditionalProperties>
			<ItemClassificationCode>206</ItemClassificationCode>
			<OutOfVAT>0</OutOfVAT>
		</Properties>
		<Conditions>
			<ShipFrom>
				<CountryDeparture>AEAD</CountryDeparture>
			</ShipFrom>
			<ShipTo>
				<CountryArrival>AEDB</CountryArrival>
			</ShipTo>
			<ContinuousSupply>0</ContinuousSupply>
			<DateTransaction>2019-02-12</DateTransaction>
		</Conditions>
		<AdditionalMentioning>
			<Text>De goederen worden vervoerd van Abu Dhabi naar Dubai. / The goods are transported from Abu Dhabi to Dubai.</Text>
		</AdditionalMentioning>
	</Item>
	<AmountsSummary CurrencyNumber="1">
		<VATTotals VATRate="5">
			<AmountDisconto>0</AmountDisconto>
			<AmountExclVAT>100</AmountExclVAT>
			<AmountVAT>5</AmountVAT>
		</VATTotals>
		<Totals>
			<TotalAmountVAT>5</TotalAmountVAT>
			<TotalAmountInclVAT>105</TotalAmountInclVAT>
			<TotalAmountDisconto>0</TotalAmountDisconto>
			<TotalAmountInclVATCash>105</TotalAmountInclVATCash>
			<TotalAmountPackagingCosts>0</TotalAmountPackagingCosts>
		</Totals>
	</AmountsSummary>
	<CheckValue>100</CheckValue>
</iVATEngineInput>]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>